app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
          <td>Expiration: <%= order.expiration %></td>
          <td>Quantity: <%= order.order_quantity %></td>