app/controllers/movies_controller.rb

	def create
		@movie = Movie.new(movie_params)

		if @movie.save
---
INSERT INTO "movies" ("title", "showtime", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hero"], ["showtime", "12-12-2016"], ["created_at", "2016-02-24 20:35:08.061534"], ["updated_at", "2016-02-24 20:35:08.061534"]]

	def update
		@movie = Movie.find(params[:id])
		if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "showtime" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["showtime", "23-05-2016"], ["updated_at", "2016-02-29 20:34:02.669637"], ["id", 1]]