app/controllers/orders_controller.rb

INSERT INTO "orders" ("age", "first_name", "last_name", "email", "credit_card", "expiration", "order_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
    	@order = Order.new(order_params)

    	if @order.save