app/controllers/showtimes_controller.rb

	def show
		@showtime = Showtime.find(params[:id])
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = ? LIMIT 1  [["id", 4]]

	def edit
		@showtime = Showtime.find(params[:id])
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = ? LIMIT 1  [["id", 5]]

    def update
    	@showtime = Showtime.find(params[:id])
    	if @showtime.update_attributes(showtime_params)
---
SELECT  "showtimes".* FROM "showtimes" WHERE "showtimes"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "showtimes" SET "date" = ?, "updated_at" = ? WHERE "showtimes"."id" = ?  [["date", "8"], ["updated_at", "2016-02-24 18:31:41.621599"], ["id", 5]]