app/controllers/theaters_controller.rb

	def show
		@theater = Theater.find(params[:id])
---
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 2]]

	def create
		@theater = Theater.new(theater_params)

		if @theater.save
---
INSERT INTO "theaters" ("name", "seats", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "HDOne"], ["seats", 45], ["created_at", "2016-03-07 16:40:52.863266"], ["updated_at", "2016-03-07 16:40:52.863266"]]

	def edit
		@theater = Theater.find(params[:id])
---
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 4]]

	def update
		@theater = Theater.find(params[:id])
		if @theater.update_attributes(theater_params)
---
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "theaters" SET "seats" = ?, "updated_at" = ? WHERE "theaters"."id" = ?  [["seats", 56], ["updated_at", "2016-03-07 18:40:26.011181"], ["id", 3]]

	def destroy
		@theater = Theater.find(params[:id])
		@theater.destroy
---
SELECT  "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 12]]